Repository: viniciusddrft/Jiu-jitsu_para_todos
Catalog: lib/core/l10n/app_*.arb
Languages: pt

# text_splash_screen_page
source: Jiu-jitsu for everyone
pt: Jiu-jitsu para todos

# title_appbar_home_page
source: Jiu-jitsu for everyone
pt: Jiu-jitsu para todos

# button_history_of_jiujitsu_home_page
source: History
pt: Hístoria

# button_rules_home_page
source: Rules
pt: Regras

# button_fight_marker_home_page
source: Fight marker
pt: Marcador de luta

# button_wallpapers_home_page
source: Wallpapers
pt: Papeis de parede

# title_appbar_settings_page
source: Settings
pt: Configurações

# button_credits_settings_page
source: Credits
pt: Créditos

# button_language_settings_page
source: Languages
pt: Idiomas

# text_brazilian_portuguese
source: Brazilian Portuguese
pt: Português do Brasil

# text_english_united_states
source: Englis United States
pt: Inglês dos Estados Unidos

# text_notice_popup
source: Close and open the app so that the language change is done completely.
pt: Feche e abra o app para que a troca de idioma seja feita completamente.

# text_continue_popup
source: Continue
pt: Continuar

# text_version
source: Version
pt: Versão

# text_contact
source: Contact
pt: Contato

# text_about_the_app
source: About the app
pt: Sobre o app

# text_rate_the_app
source: Rate the app
pt: Avalie o app

# text_cancel
source: Cancel
pt: Cancelar

# title_appbar_credits_page
source: Credits
pt: Créditos

# text_all_application_icons_are_from_flaticon
source: All application icons are from Flaticon.
pt: Todos ícones do aplicativo são da Flaticon.

# text_the_application_was_developed_in_flutter
source: The application was developed in flutter.
pt: O aplicativo foi desenvolvido em Flutter.

source: If you want to know both the Flutter and the Flaticon, just click on the icons.
pt: Caso queira conhecer tanto o Flutter quanto a Flaticon basta cliclar nos ícones.

# title_appbar_history_of_jiujitsu_page
source: History of Jiu-jitsu
pt: Hístoria do Jiu-jitsu

# button_origin_of_jiujitsu
source: Origin of Jiu-jitsu
pt: Origem do Jiu-jitsu

# button_jiujitsu_in_brazil
source: The Brazilian Jiu-jitsu
pt: O Jiu-jitsu no Brasil

# title_appbar_rule_page
source: Rules
pt: Regras

# button_basic_rules
source: Basic rules
pt: Regras Básicas

# button_cbjj_Rules
source: CBJJ rules
pt: Regras da CBJJ

# button_white_belt_level
source: White Belt Level
pt: Nível Faixa Branca

# button_blue_belt_level
source: Blue Belt Level
pt: Nível Faixa Azul

# button_black_belt_level
source: Black Belt Level
pt: Nível Faixa Preta

# title_appbar_fightmarker_page
source: Fight marker
pt: Marcador de luta

# text_label_minutes_popup
source: Minutes
pt: Minutos

# text_label_seconds_popup
source: Seconds
pt: Segundos

# text_button_popup_continue
source: Continue
pt: Continuar

# text_button_stopsound
source: Stop sound
pt: Parar som

# text_abbreviated_advantage
source: A
pt: V

# title_appbar_wallpapers
source: Wallpapers
pt: Papeis de parede

# button_save_image
source: Save image
pt: Salvar imagem

# text_popup_success
source: Image saved successfully !!!
pt: Imagem salva com sucesso!!!

# text_popup_error
source: Something went wrong :/
pt: Aconteceu algum erro :/

# title_appbar_origin_of_jiujitsu_page
source: Origin of Jiu-jitsu
pt: Origem do Jiu-jitsu

# text_origin_of_jiujitsu_paragraph1
source: Despite your growing popularity in Japan, the history of jiu-jitsu started on India (that justifies the name “cradle of martial arts”) more than two thousand years ago.
pt: Apesar de sua popularidade crescente no Japão, a história do Jiu-jitsu começou na Índia (daí o nome “berço das arte artes marciais”), há mais de dois mil anos.

# text_origin_of_jiujitsu_paragraph2
source: The religion forbade monks Indian monasteries to defend yourself. But when they practiced long walks, they suffered assaults by bandits of Mongolian tribes from North Asia, so the need arose for body-to-body defense.
pt: A religião proibia monges monastérios indianos a se defender com armas. Mas quando faziam caminhadas eles foram atacados por bandidos das tribos mongóis do norte da Ásia, e surgiu então a necessidade da defesa corpo a corpo.

# text_origin_of_jiujitsu_paragraph3
source: The specialists of vital points of the human body developed a kind of special defense for his tiny and skinny people. This kind of jiu-jitsu prototypes finally crossed the China borders and tracked to Japan archipelagos where the development was located, but that was known only by nobles and samurais. This prototypes was known as “Soft Art”.
pt: Os conhecedores dos pontos vitais do corpo desenvolveram uma espécie defesa especial para as características físicas pro seu baixo e magro povo. Este tipo de prototipo de jiu-jitsu finalmente cruzou a linha fronteiras da China e seguiu para o arquipélago japonês onde foi desenvolvido, mas conhecido apenas por nobres e samurais. No Japão O Jiu-jitsu é literalmente conhecido como “Arte Suave”.

# text_origin_of_jiujitsu_paragraph4
source: The jiu-jitsu was the most practiced fight in Japan for a long time until the appearance of judo as a sport at 1882, through the master of jiu-jitsu, Jigoro Kano. The judo removes the traumatic techniques from the most dangerous and efficiency jiu-jitsu and create the sport as we know now. However there were still many styles of jiu-jitsu that were also branched by the competitors.
pt: No Japão O Jiu-jitsu é literalmente conhecido como “Arte Suave”. O Jiu-jitsu foi a luta mais praticada no Japão por muito tempo, até o surgimento do judô como esporte em 1882, através do Mestre de Jiu-Jitsu, Jigoro Kano. Isso remove as técnicas traumáticas do jiu-jitsu mais perigoso e eficiente e cria o esporte como o conhecemos hoje.Mas havia vários estilos de jiu-jitsu e que também eram ramificados pelos competidores.

# text_origin_of_jiujitsu_paragraph5
source: The jiu-jitsu was forbidden in Japan by a while as a crime against your own country. With the introduction of Western culture in Japan promote by the emperor Mutso Hito(1867-1912) the martial arts was forgotten. Until later, when the Western started to appreciate and “import” this fight types.
pt: O Jiu-Jitsu foi proibido no Japão por um tempo Como um crime contra sua pátria. Com introdução da cultura ocidental no Japão promovida pelo Imperador Mutsu Hito as artes marciais foram esquecidas, até mais tarde, quando o ocidente começou a apreciar e importar esse tipo de luta.

# title_appbar_jiujitsu_in_brazil_page
source: The Brazilian Jiu-jitsu
pt: O Jiu-jitsu no Brasil

# text_jiujitsu_in_brazil_paragraph1
source: The Japanese master, Mitsuo Maeda know as Konde Koma, went to Brazil on a diplomatic mission and in Belem from Para, he knew Gastao Gracie and from that moment emerged a great friendship. Conde Kome by affinity for Gastao started to teach jiu-jitsu to son of Gastao, Carlos Gracie that later taught to his brothes, mainly Helio Gracie. They improved the know techniques, making them more efficiency and available for all kinds of people. This development was based in the introduction of the lever techniques in traditional Japanese techniques.
pt: O mestre japonês, Mitsuo Maeda conhecido como Konde Koma, foi para o Brasil em missão diplomática, e em Belém, Pará, conheceu Gastão Gracie e a partir desse momento surgiu uma excelente amizade. Conde Koma por afinidade concedido por Gastão, ele começou a ensinar Jiu-jitsu para seu filho, Carlos Gracie, que mais tarde aprendendo a arte, ele ensinou aos irmãos, principalmente Hélio Gracie. Eles aprimoraram as técnicas conhecidas, tornando-as mais eficientes e disponível para todos os tipos de corpo. Este desenvolvimento foi com base na introdução de técnicas de alavanca nas técnicas tradicionais japonesas.

# text_jiujitsu_in_brazil_paragraph2
source: Because of your fragile health, Helio, the smaller Gracie, couldn’t train the traditional jiu-jitsu taught by his brothers, how he was an observer, Helio started to follow, from the thirteen to sixteen years, the classes taught by Carlos Greice. Helio learned all the techniques and teachings of his brother but to compensate your biotype, he improved the traditional ground fight by the use of the lever, giving to him the extra strength that lacked, thus creating the Brazilian jiu-jitsu.
pt: Devido à sua saúde frágil, Hélio, o menor dos Gracies, não podia treinar o tradicional Jiu-Jitsu ensinado por seus irmãos, especialmente Carlos Gracie. Observador, Hélio passou a acompanhar, dos treze aos dezesseis anos, as aulas ministradas por Carlos. Ele aprendeu todas as técnicas e ensinamentos do irmão, mas, para compensar seu biótipo, Hélio melhorou a parte tradicional do solo por meio do uso do alavanca, dando a ele a força extra que ele não tinha, criando assim o Jiu Jitsu brasileiro.

# text_jiujitsu_in_brazil_paragraph3
source: That’s how it was born the Gracie jiu-jitsu also known as the Brazilian jiu-jitsu, the best and most efficient self defense way in the world, proven by the results of constant competitions of MMA existing in the world.
pt: Foi assim que nasceu o Gracie Jiu-jitsu, também conhecido como Jiu-jitsu Brasileiro, a melhor e mais eficaz forma de autodefesa do mundo, já provadas, pelos resultados das constantes competições de vale tudo existente no mundo.

# title_appbar_basic_rules_page
source: Basic rules
pt: Regras Básicas

# text_overview_title
source: Overview
pt: Visão geral

# text_overview
source: In this category you will learn the basic about the rules of jiu-jitsu championship, to start you need to understand that the fights are divided by weight, belt and age and thereby the rules also has a small change, and It’s essential to say that in jiu-jitsu, traditional attacks isn’t allowed like kicks, punches, knees, elbows and infinity others attacks aren’t allowed too, also exist in championships the famous “absolute” that is a weightless category, only divided by belt and age, remembering that in any fight the completion gives the direct victory and if the time is over without any completions, the fights will be decided by the score, advantages and penalties, in case everything’s tied the decision will be the judge’s.
pt: Nesta categoria você irá aprender o básico sobre as regras de campeonatos de jiu-jitsu para começar você deve entender que as lutas são divididas por peso, faixa e idade e com isso as regras também tem uma pequena mudança é essencial dizer que no jiu-jitsu não é permitido nenhum ataque “tradicional” como chutes, socos, joelhadas, cotoveladas e uma infinidade de outros ataques são proibidos, existe também nos campeonatos o famoso “absoluto” que é uma categoria sem peso, apenas por faixa e idade, lembrando que em qualquer luta a finalização da a vitoria direta e se o tempo acabar sem finalizações as lutas serão decididas pelos pontos, vantagens e punições, caso tudo esteja empatado é decisão do juiz.

# text_scores_title
source: Scores
pt: Pontuação

# text_scores
source: In jiu-jitsu, the score is divided into 2 score, 3 score and 4 score, also exist the advantages and penalties but we will talk about theirs later.
pt: No jiu-jitsu, a pontuação é dividida em 2 pontos, 3 pontos e 4 pontos, existem também as vantagens e punições mas vamos falar delas depois.

# text_moves_that_gives_2_scores_title
source: Moves that gives 2 scores
pt: Movimentos que valem 2 pontos

# text_throws
source: Throws → there are many factors for a throw be considered, the throw needs to have a beginning inside the fight area and it’s necessary the 3 seconds stabilization, this applies for any kind of throw.
pt: Quedas → existem vários fatores para que uma queda seja considerada, ela deve ter inicio dentro da área de luta e é necessário a estabilização de 3 segundos , isso se aplica para qualquer tipo de queda.

# text_knee_in_belly
source: Knee in belly → to be considered, needs a 3 seconds stabilization
pt: Joelho na barriga → para ser considerado precisa de estabilização de 3 segundos.

# text_sweep
source: Sweep → a sweep is basically turn over the position from a full guard. Imagine that you are doing the full guard, therefore you are below and you opponent above, in sweep you turn over the position staying above, It’s important that the postion starts with a guard type, you can sweep and stay on top mounted in the opponents guard or with any other way that you prefer, It doesn’t interfere with anything, you just need to let your opponent with your back to mat and stay above, It’s needed to stabilize for 3 seconds to win the throw scores
pt: Raspagem → uma raspagem basicamente é inverter a posição a partir de uma guarda. Imagine que você está fazendo guarda sendo assim você está em baixo e seu adversário em cima, na raspagem você inverte a posição ficando por cima, é importante que a posição comece de algum tipo de guarda, você pode raspare ficar por cima montado na guarda do adversário ou como preferir isso não interfere em nada você só precisa deixar seu adversário de costas no tatame e ficar por cima é preciso estabilizar 3 segundos para ganhar os pontos da raspagem.

# text_moves_that_gives_3_scores_title
source: Moves that gives 3 scores
pt: Movimento que vale 3 ponto

# text_moves_that_gives_3_scores
source: In jiu-jitsu there is only one move that gives 3 scores.
pt: No jiu-jitsu só existe um movimento que vale 3 pontos

# text_guard_pass
source: Guard pass → goes for absolutely any guard type, you will need to get on side control, mount or north south, to win scores it’s need the 3 seconds stabilization
pt: passagem de guarda → vale pra absolutamente qualquer tipo de guarda você precisa chegar na lateral, montada ou norte sul para ganhar os pontos é necessário estabilizar por 3 segundos.

# text_moves_that_gives_4_scores_title
source: Moves that gives 4 scores
pt: Movimentos que valem 4 pontos

# text_mount
source: Mount → any mount type counts to win the scores and needed the 3 seconds stabilization
pt: Montada → qualquer montada conta para ganhar os pontos precisa estabilizar 3 segundos.

# text_backward_grip
source: Backward grip → you need to get on opponent back and put the hooks, it’s needed the 3 seconds stabilization
pt: Pegada nas costas → você precisa chegar nas costas e conseguir por os ganchos é necessário estabilizar 3 segundos.

# text_advantage_and_penalties_title
source: Advantage and penalties
pt: Vantagem e punições

# text_advantage_and_penalties
source: The advantage can be decisive, you will win an advantage every time that you represent risk to the opponent, for example, imagine that you almost finalize the opponent or almost throw him, in this case you get an advantage, but remembering, if you succeed the throw you don’t will get an advantage but will get 2 throw scores, scores always will have a bigger weight in the fight decision than the advantages, the advantages serves to tiebreaker if the score’s tied. There are many penalties types, the very serious penalties leads to immediate disqualification, out of that case, if you receive a very serious penalties will be a heaviness in the final decision, if you receive 2 penalties your opponent win an advantage, if you receive 3 penalties your opponent win 2 scores and in the fourth penalty you will be disqualified, there are many situations that can give you a penalty, for example, the lack of competitiveness, but exist many others. If you want to know more about the penalties take a look in rules from CBJJ .
pt: A vantagem pode ser decisiva ela você ganha uma vantagem toda vez que representar risco ao oponente como exemplo imagine que você quase finaliza o oponente ou quase da uma queda nela nesse caso você ganha vantagem mas lembrando que caso você consiga dar a queda você não ganhara vantagem e sim os 2 pontos da queda, pontos sempre terão um peso maior na decisão da luta do que as vantagens, as vantagens servem de desempate caso a pontuação esteja igual.Existem vários tipos de punições as punições gravíssimas levam a desclassificação imediata, fora esse caso se você receber uma punição isso já tera um peso na decisão final, caso você receba 2 punições seu adversário recebe uma vantagem se você receber 3 punições seu adversário recebe 2 pontos e na quarta punição você sera desclassificado, existem varias situações que pode te levar a uma punição como por exemplo a falta de combatividade mas existem varias outras se quiser saber mais sobre as punições de uma olhada nas regras da CBJJ.

# title_appbar_cbjj_rules_page
source: CBJJ rules
pt: Regras da CBJJ

# text_cbjj
source: The CBJJ rules are the rules of the vast majority of the championships, if you want to go deeper and understand how all rules works just use the buttom below
pt: As regras da CBJJ são as regras da grande maioria dos campeonatos, se você quer se aprofundar e entender como todas regras funcionam é só usar o botão a baixo.

# text_button_cbjj
source: Official site
pt: Site Oficial

# text_difficultyname_white_belt
source: White Belt
pt: Faixa Branca

# text_difficultyname_blue_belt
source: Blue Belt
pt: Faixa Azul

# text_difficultyname_black_belt
source: Black Belt
pt: Faixa preta

# text_question
source: Question
pt: Questão

# text_result_quiz_white_belt
source: His black white quiz score was:
pt: Sua pontuação no quiz da faixa branca foi:

# text_result_quiz_blue_belt
source: His blue belt quiz score was:
pt: Sua pontuação no quiz da faixa azul foi:

# text_result_quiz_black_belt
source: His black belt quiz score was:
pt: Sua pontuação no quiz da faixa preta foi:

# text_message_quiz_very_well
source: Oss, did very well!!!
pt: Oss, mandou muito bem!!!

# text_message_quiz_almost
source: Almost, study more.
pt: Faltou pouco, estude mais.

# text_message_quiz_sad
source: It was not this time.
pt: Não foi dessa vez.
